src/cf/Enums/SurveyModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>SurveyModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Questionnaire</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Interview</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Questionnaire.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Questionnaire</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.QuestionnaireQuestionAnswers</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Survey</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.PollPurpose</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Respondent</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Respondent</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SectionToEdit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Interviewer</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Interviewer</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuestionnaireTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SurveyMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SurveyModes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Content</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Question</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ElementaryQuestion</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CellNumber</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Response</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.QuestionsForSurvey</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OpenAnswer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/QuestioningClient/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region Private

// Creates a filter structure for its further transfer to the server and usage as filter parameters 
// in dynamic lists of forms to be called.
//
Function CreateFilterParameterStructure(FilterType,LeftValue,ComparisonType,RightValue) Export

	ReturnStructure = New Structure;
	ReturnStructure.Insert("FilterType",FilterType);
	ReturnStructure.Insert("LeftValue",LeftValue);
	ReturnStructure.Insert("ComparisonType",ComparisonType);
	ReturnStructure.Insert("RightValue",RightValue);
	
	Return ReturnStructure;

EndFunction

// Starts an interview with the selected respondent.
//
// Parameters:
//  Respondent   - DefinedType.Respondent - an interviewee.
//  QuestionnaireTemplate - CatalogRef.QuestionnaireTemplates - a template used for interview.
//               - Undefined - a user selects a template from the catalog.
//
Procedure StartInterview(Respondent, QuestionnaireTemplate=Undefined) Export
	
	If QuestionnaireTemplate=Undefined Then
	
		NotifyDescription = New NotifyDescription("StartInterviewWithTemplateChoiceCompletion", ThisObject, Respondent);
		
		ShowInputValue(NotifyDescription, Undefined, , Type("CatalogRef.QuestionnaireTemplates"));
		
	Else
		
		OpenInterviewForm(Respondent, QuestionnaireTemplate);
		
	EndIf;
		
EndProcedure

// Opens the form of a new questionnaire in interview mode with the selected respondent and questionnaire template.
//
Procedure OpenInterviewForm(Respondent, QuestionnaireTemplate)
	
	FillingValues = New Structure;
	FillingValues.Insert("Respondent", Respondent);
	FillingValues.Insert("QuestionnaireTemplate", QuestionnaireTemplate);
	FillingValues.Insert("SurveyMode", PredefinedValue("Enum.SurveyModes.Interview"));
	
	FormParameters = New Structure;
	FormParameters.Insert("FillingValues", FillingValues);
	FormParameters.Insert("FillingFormOnly", True);
	
	QuestionnaireForm = OpenForm("Document.Questionnaire.ObjectForm", FormParameters);
	
	If QuestionnaireForm <> Undefined Then
		FillPropertyValues(QuestionnaireForm, FillingValues);
	EndIf;
	
EndProcedure

// StartInterviewWithTemplateChoice procedure execution result handler.
//
Procedure StartInterviewWithTemplateChoiceCompletion(SelectedTemplate, Respondent) Export
	
	If SelectedTemplate = Undefined Then
		Return;
	EndIf;
	
	OpenInterviewForm(Respondent, SelectedTemplate);	
	
EndProcedure

#EndRegion
